Revit 2027 API
MultiReferenceAnnotation.DimensionId Property
 The child dimension owned by this multi-reference annotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId DimensionId { get; }
Public ReadOnly Property DimensionId As ElementId
	Get
public:
property ElementId^ DimensionId {
	ElementId^ get ();
}
member DimensionId : ElementId with get
Property Value
ElementId
See Also
Reference
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace